code-review/NRB_3471_3546/База_Стало/Reports/ОбъемОперацийЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ОбъемОперацийЦБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/КатегорияЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КатегорияЦБ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЦБ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/AccumulationRegisters/ОстаткиЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦБ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусЦБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/РежимыТоргов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>РежимыТоргов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рыночная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеполныеЛоты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыкупАукцион</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыкупАдресныеЗаявки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеВыкуп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеАдресныеЗаявки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/КонвертацияЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КонвертацияЦБ</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦБ</xr:Item>
				<xr:Item>AccumulationRegister.ЦБВПути</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонвертаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьДробноеКоличествоЦБ</Name>
					<Comment>Округлять дробное количество ценных бумаг</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумагиИсходные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦБ</Name>
							<Comment>ЦБ</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИсходных</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦБ</Name>
							<Comment>ЦБ</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИтоговых</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Списание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепоМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепоМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЦБ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепоМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепоМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЦБ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/ОбъемОперацийЦБ/Ext/ObjectModule.bsl
Перем ТаблицаЗначенийОпераций;

Функция ЗаголовокОтчета() Экспорт
	Возврат  "Количество и объемы проведеных депозитарных операций ";
КонецФункции

// Функция делает выборку депозитарных операций из регистра ОстаткиЦБ.
//
// Параметры
// БезПараметров
//
// Возвращаемое значение:
//   ТаблицаЗначений.Результат запроса.
//
Функция КоличествоОбъемОпераций() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Котировки.ЦеннаяБумага,
	|	МАКСИМУМ(Котировки.Период) КАК Период
	|ПОМЕСТИТЬ ВремяКотировок
	|ИЗ
	|	РегистрСведений.Котировки КАК Котировки
	|ГДЕ
	|	Котировки.РежимТоргов.РежимТоргов = ЗНАЧЕНИЕ(Перечисление.РежимыТоргов.Рыночная)
	|	И Котировки.Период <= &КонДата
	|СГРУППИРОВАТЬ ПО
	|	Котировки.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КотировкиСрезПоследних.ЦеннаяБумага
	|ПОМЕСТИТЬ А1
	|ИЗ
	|	РегистрСведений.Котировки.СрезПоследних(&КонДата, ) КАК КотировкиСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремяКотировок КАК ВремяКотировок
	|		ПО КотировкиСрезПоследних.ЦеннаяБумага = ВремяКотировок.ЦеннаяБумага
	|			И КотировкиСрезПоследних.Период = ВремяКотировок.Период
	|ГДЕ
	|	(ПОДСТРОКА(КотировкиСрезПоследних.РежимТоргов.Код, 1, 2) = ""EQ""
	|	ИЛИ ПОДСТРОКА(КотировкиСрезПоследних.РежимТоргов.Код, 1, 2) = ""TQ"")
	|	И КотировкиСрезПоследних.РежимТоргов.Код <> ""EQCC""
	|	И КотировкиСрезПоследних.РежимТоргов.Код <> ""EQDP""
	|	И КотировкиСрезПоследних.РежимТоргов.Код <> ""EQUS""
	|	И КотировкиСрезПоследних.РежимТоргов.Код <> ""EQEU""
	|	И КотировкиСрезПоследних.РежимТоргов.Код <> ""EQQI""
	|	И (КотировкиСрезПоследних.КотировальныйЛист = ""1""
	|	ИЛИ КотировкиСрезПоследних.КотировальныйЛист = ""2"")
	|СГРУППИРОВАТЬ ПО
	|	КотировкиСрезПоследних.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КатегорияЦБ.ЦеннаяБумага,
	|	МАКСИМУМ(КатегорияЦБ.Период) КАК Период
	|ПОМЕСТИТЬ ВремяКатегорий
	|ИЗ
	|	РегистрСведений.КатегорияЦБ КАК КатегорияЦБ
	|ГДЕ
	|	КатегорияЦБ.Период <= &КонДата
	|
	|СГРУППИРОВАТЬ ПО
	|	КатегорияЦБ.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБОбороты.ЦБ.Эмитент КАК ЦБЭмитент,
	|	ВЫБОР
	|		КОГДА ОстаткиЦБОбороты.ЦБ.НомерРегистрации <> """"
	|			ТОГДА ОстаткиЦБОбороты.ЦБ.НомерРегистрации
	|		ИНАЧЕ ОстаткиЦБОбороты.ЦБ.ISIN
	|	КОНЕЦ КАК ЦБ,
	|	ВЫБОР
	|		КОГДА А1.ЦеннаяБумага ЕСТЬ NULL 
	|			ТОГДА ""Прочие""
	|		ИНАЧЕ ""А1""
	|	КОНЕЦ КАК Категория,
	|	ВЫБОР
	|		КОГДА ОстаткиЦБОбороты.Регистратор ССЫЛКА Документ.КонвертацияЦБ
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Конвертация)
	|		КОГДА ОстаткиЦБОбороты.Регистратор ССЫЛКА Документ.ПогашениеЦБ
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Погашение)
	|		КОГДА ОстаткиЦБОбороты.Регистратор ССЫЛКА Документ.ГлобальнаяОперация
	|			ТОГДА ОстаткиЦБОбороты.Регистратор.ВидГлобальнойОперации
	|		ИНАЧЕ ОстаткиЦБОбороты.Регистратор.ВидОперацииД
	|	КОНЕЦ КАК РегистраторВидОперацииД,
	|	ВЫБОР
	|		КОГДА ОстаткиЦБОбороты.Регистратор.ВидОперацииД = &Депонирование
	|				ИЛИ ОстаткиЦБОбороты.Регистратор ССЫЛКА Документ.КонвертацияЦБ
	|					И ОстаткиЦБОбороты.КоличествоПриход > 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Депонирование,
	|	ВЫБОР
	|		КОГДА ОстаткиЦБОбороты.Регистратор.ВидОперацииД = &Снятие
	|		ИЛИ ОстаткиЦБОбороты.Регистратор ССЫЛКА Документ.КонвертацияЦБ
	|		И ОстаткиЦБОбороты.КоличествоРасход > 0
	|		ИЛИ ОстаткиЦБОбороты.Регистратор ССЫЛКА Документ.ПогашениеЦБ
	|		ИЛИ (ОстаткиЦБОбороты.Регистратор ССЫЛКА Документ.ГлобальнаяОперация
	|			И
	|				(ОстаткиЦБОбороты.Регистратор.ВидГлобальнойОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Погашение)
	|				ИЛИ ОстаткиЦБОбороты.Регистратор.ВидГлобальнойОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеАкцийПриЛиквидацииЭмитента)
	|				ИЛИ ОстаткиЦБОбороты.Регистратор.ВидГлобальнойОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеОбесценившихсяЦенныхБумаг)
	|				)
	|			)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Снятие,
	|	ВЫБОР
	|		КОГДА ОстаткиЦБОбороты.Регистратор.ВидОперацииД = &Перевод
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Перевод,
	|	ОстаткиЦБОбороты.КоличествоОборот КАК КоличествоОборот,
	|	ОстаткиЦБОбороты.КоличествоПриход КАК КоличествоПриход,
	|	ОстаткиЦБОбороты.КоличествоРасход КАК КоличествоРасход
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Обороты(&НачДата, &КонДата, Регистратор, ) КАК ОстаткиЦБОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КатегорияЦБ КАК КатегорияЦБ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремяКатегорий КАК ВремяКатегорий
	|			ПО КатегорияЦБ.ЦеннаяБумага = ВремяКатегорий.ЦеннаяБумага
	|				И КатегорияЦБ.Период = ВремяКатегорий.Период
	|		ПО ОстаткиЦБОбороты.ЦБ = КатегорияЦБ.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ А1 КАК А1
	|		ПО ОстаткиЦБОбороты.ЦБ = А1.ЦеннаяБумага
	|ИТОГИ
	|	СУММА(Депонирование),
	|	СУММА(Снятие),
	|	СУММА(Перевод),
	|	СУММА(КоличествоОборот),
	|	СУММА(КоличествоПриход),
	|	СУММА(КоличествоРасход)
	|ПО
	|	ЦБЭмитент,
	|	ЦБ,
	|	Категория,
	|	РегистраторВидОперацииД";
	
	Запрос.УстановитьПараметр("Депонирование",Справочники.ВидыОпераций.Депонирование);
	Запрос.УстановитьПараметр("Снятие",Справочники.ВидыОпераций.СнятиеСДепонирования);
	Запрос.УстановитьПараметр("Перевод",Справочники.ВидыОпераций.Перевод);
	Запрос.УстановитьПараметр("НачДата",НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("КонДата",КонецДня(КонПериода));
	
	Результат = Запрос.Выполнить();
		
    Возврат Результат;
	
КонецФункции // КоличествоОбъемОпераций()
 
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	ТаблицаЗначенийОпераций.Очистить();
	ТабличныйДокумент.Очистить();
	
	РезультатЗапроса = КоличествоОбъемОпераций();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Сообщить("Нет операций за выбранный период!");	
		
	Иначе

		Дерево = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		Для каждого ВеткаЭмитент Из Дерево.Строки Цикл
			Для каждого ВеткаЦБ Из ВеткаЭмитент.Строки Цикл
				
				ВеткаПериод	= ВеткаЦБ.Строки[0];
				Если ВеткаПериод <> Неопределено Тогда 
					
					Для каждого ВеткаКатегория Из ВеткаЦБ.Строки Цикл
						Для каждого ВеткаВидОперации Из ВеткаКатегория.Строки Цикл
							
							КоличествоПрием   = 0; 	ОбъемПрием		  = 0;
							КоличествоСнятие  = 0; 	ОбъемСнятие		  = 0;
							КоличествоПеревод = 0; 	Объемперевод	  = 0;

							//определение количества и объема.
							Если ВеткаВидОперации.РегистраторВидОперацииД = Справочники.ВидыОпераций.Депонирование Тогда
								КоличествоПрием   = ВеткаВидОперации.Депонирование;
								ОбъемПрием		  = ВеткаВидОперации.КоличествоПриход; 								
							ИначеЕсли ВеткаВидОперации.РегистраторВидОперацииД = Справочники.ВидыОпераций.Конвертация Тогда
								КоличествоПрием   = ВеткаВидОперации.Депонирование;
								ОбъемПрием		  = ВеткаВидОперации.КоличествоПриход; 								
								КоличествоСнятие  = ВеткаВидОперации.Снятие;
								ОбъемСнятие		  = ВеткаВидОперации.КоличествоРасход;
							Иначе 	
								Если ВеткаВидОперации.РегистраторВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования
									ИЛИ ВеткаВидОперации.РегистраторВидОперацииД = Справочники.ВидыОпераций.Погашение
									ИЛИ ВеткаВидОперации.РегистраторВидОперацииД = Справочники.ВидыОпераций.СписаниеАкцийПриЛиквидацииЭмитента
									ИЛИ ВеткаВидОперации.РегистраторВидОперацииД = Справочники.ВидыОпераций.СписаниеОбесценившихсяЦенныхБумаг
									Тогда
									КоличествоСнятие  = ВеткаВидОперации.Снятие;
									ОбъемСнятие		  = ВеткаВидОперации.КоличествоРасход;
								ИначеЕсли ВеткаВидОперации.РегистраторВидОперацииД = Справочники.ВидыОпераций.Перевод Тогда
									КоличествоПеревод = ВеткаВидОперации.Перевод;
									Объемперевод	  = ВеткаВидОперации.КоличествоРасход;
								КонецЕсли; 								
							КонецЕсли; 
							
							//заполнение ТаблицыЗначенийОпераций.							
							Если ВеткаВидОперации.ЦБ = Перечисления.ТипыЦБ.Вексель Тогда
								
								ЗаполнениеГруппыТЗ("Векселя", ВеткаВидОперации.ЦБЭмитент, 
									СокрЛП(ВеткаВидОперации.ЦБ), 
									КоличествоПрием, ОбъемПрием,
									КоличествоСнятие, ОбъемСнятие,
									КоличествоПеревод, Объемперевод);
								
							Иначе	
								
								Если ВеткаВидОперации.Категория = "Прочие" Тогда
									
									ЗаполнениеГруппыТЗ("ПрочиеЭмитенты",ВеткаВидОперации.ЦБЭмитент, 
									СокрЛП(ВеткаВидОперации.ЦБ), 
									КоличествоПрием, ОбъемПрием,
									КоличествоСнятие, ОбъемСнятие,
									КоличествоПеревод, Объемперевод); 
									
								Иначе	
									
									ЗаполнениеГруппыТЗ("Эмитенты, ценные бумаги которых включены в листинг",ВеткаВидОперации.ЦБЭмитент,СокрЛП(ВеткаВидОперации.ЦБ), 
									КоличествоПрием, ОбъемПрием,
									КоличествоСнятие, ОбъемСнятие,
									КоличествоПеревод, Объемперевод); 
									
								КонецЕсли; 
								
							КонецЕсли; 														
														
						КонецЦикла;	//веткаОперации				
					КонецЦикла;//Веткакатегории
					
				Иначе
					Сообщить("Не определена Категория ЦБ - " + Строка(ВеткаЦБ.ЦБ));
				КонецЕсли;
				
			КонецЦикла;//ВеткаЦБ			
		КонецЦикла;//ВеткаЭмитент
		
	КонецЕсли;
	
	//предварительная очитска табличного документа.	
	Макет = ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	ОбластьШапка.Параметры.ОписаниеПериода = Период;
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ТаблицаЗначенийОпераций.Свернуть("ГруппаЦБ,Эмитент,НомерРег","КолПрием,ОбПрием,КолСнятие,ОбСнятие,КолПеревод,ОбПеревод");
	ТаблицаЗначенийОпераций.Сортировать("ГруппаЦБ Убыв,Эмитент");
	
	ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
	ОбластьГруппаЭмитентов 	= Макет.ПолучитьОбласть("ГруппаЭмитентов");
	НПП						= 1;
	
	Для каждого ТекущаяСтрока Из ТаблицаЗначенийОпераций Цикл
		
		Если НПП = 1 Тогда
		
			ОбластьГруппаЭмитентов.Параметры.НаименованиеГруппы = ТекущаяСтрока.ГруппаЦБ;
			ТабличныйДокумент.Вывести(ОбластьГруппаЭмитентов);
		    ГруппаЭмитента =  ТекущаяСтрока.ГруппаЦБ;
			
		КонецЕсли; 
		
		Если ТекущаяСтрока.ГруппаЦБ = ГруппаЭмитента Тогда
			
			ОбластьСтрока.Параметры.Заполнить(ТекущаяСтрока);
			ОбластьСтрока.Параметры.НПП 		= НПП; НПП = НПП + 1;
			ОбластьСтрока.Параметры.КолВсего	= ТекущаяСтрока.КолПрием + ТекущаяСтрока.КолСнятие + ТекущаяСтрока.КолПеревод;
			ОбластьСтрока.Параметры.ОбВсего		= ТекущаяСтрока.ОбПрием + ТекущаяСтрока.ОбСнятие + ТекущаяСтрока.ОбПеревод;
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
		Иначе	
			
			ГруппаЭмитента = ТекущаяСтрока.ГруппаЦБ;
			ОбластьГруппаЭмитентов.Параметры.НаименованиеГруппы = ТекущаяСтрока.ГруппаЦБ;
			ТабличныйДокумент.Вывести(ОбластьГруппаЭмитентов);
		   
			ОбластьСтрока.Параметры.Заполнить(ТекущаяСтрока);
			ОбластьСтрока.Параметры.НПП = НПП;
			ОбластьСтрока.Параметры.КолВсего	= ТекущаяСтрока.КолПрием + ТекущаяСтрока.КолСнятие + ТекущаяСтрока.КолПеревод;
			ОбластьСтрока.Параметры.ОбВсего		= ТекущаяСтрока.ОбПрием + ТекущаяСтрока.ОбСнятие + ТекущаяСтрока.ОбПеревод;
			ТабличныйДокумент.Вывести(ОбластьСтрока); 
						
		КонецЕсли; 	
				
	КонецЦикла; 
	
	ОбластьИтоги.Параметры.КолПрием		= ТаблицаЗначенийОпераций.Итог("КолПрием");		
	ОбластьИтоги.Параметры.ОбПрием		= ТаблицаЗначенийОпераций.Итог("ОбПрием");
	ОбластьИтоги.Параметры.КолСнятие	= ТаблицаЗначенийОпераций.Итог("КолСнятие");
	ОбластьИтоги.Параметры.ОбСнятие		= ТаблицаЗначенийОпераций.Итог("ОбСнятие");
	ОбластьИтоги.Параметры.КолПеревод	= ТаблицаЗначенийОпераций.Итог("КолПеревод");
	ОбластьИтоги.Параметры.ОбПеревод	= ТаблицаЗначенийОпераций.Итог("ОбПеревод");
	ОбластьИтоги.Параметры.КолВсего     = ОбластьИтоги.Параметры.КолПрием + ОбластьИтоги.Параметры.КолСнятие +  ОбластьИтоги.Параметры.КолПеревод;
	ОбластьИтоги.Параметры.ОбВсего		= ОбластьИтоги.Параметры.ОбПрием + ОбластьИтоги.Параметры.ОбСнятие  + ОбластьИтоги.Параметры.ОбПеревод;
	ТабличныйДокумент.Вывести(ОбластьИтоги);
	
	ТабличныйДокумент.ОтображатьСетку 		= Ложь;
	ТабличныйДокумент.ТолькоПросмотр 		= Истина;
	ТабличныйДокумент.ОтображатьЗаголовки 	= Ложь;
	
	
КонецПроцедуры
	
Процедура ЗаполнениеГруппыТЗ(Группа, Эмитент, НомерРег, КолПрием, ОбПрием, КолСнятие, ОбСнятие, КолПеревод, ОбПеревод)

	НоваяСтрока	= ТаблицаЗначенийОпераций.Добавить();
	НоваяСтрока.ГруппаЦБ	= Группа;                                                               
	НоваяСтрока.Эмитент		= Эмитент; 
	НоваяСтрока.НомерРег	= НомерРег; 
	НоваяСтрока.КолПрием	= КолПрием;
	НоваяСтрока.ОбПрием		= ОбПрием;
	НоваяСтрока.КолСнятие	= КолСнятие;
	НоваяСтрока.ОбСнятие	= ОбСнятие;
	НоваяСтрока.КолПеревод	= КолПеревод;
	НоваяСтрока.ОбПеревод	= ОбПеревод;

КонецПроцедуры

//таблица значений для вывода остатков по счету депо.
ТаблицаЗначенийОпераций = Новый ТаблицаЗначений;
ТаблицаЗначенийОпераций.Колонки.Добавить("ГруппаЦБ"); 
ТаблицаЗначенийОпераций.Колонки.Добавить("Эмитент"); 
ТаблицаЗначенийОпераций.Колонки.Добавить("НомерРег"); 
ТаблицаЗначенийОпераций.Колонки.Добавить("КолПрием");
ТаблицаЗначенийОпераций.Колонки.Добавить("ОбПрием");
ТаблицаЗначенийОпераций.Колонки.Добавить("КолСнятие");
ТаблицаЗначенийОпераций.Колонки.Добавить("ОбСнятие");
ТаблицаЗначенийОпераций.Колонки.Добавить("КолПеревод");
ТаблицаЗначенийОпераций.Колонки.Добавить("ОбПеревод");

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
